#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PHO-RSC"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "PHO RStudio Connect Analytics Platform"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PHO RStudio Connect"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://rsc-test.hlth.gov.bc.ca/*",
          + "http://tussle.hlth.gov.bc.ca/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://rsc-test.hlth.gov.bc.ca/*",
          + "https://tussle.hlth.gov.bc.ca/*",
        ]
      + web_origins                               = [
          + "*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.keycloak_openid_user_client_role_protocol_mapper.PHO-RSC-Role will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "PHO-RSC-Role" {
      + add_to_access_token = false
      + add_to_id_token     = true
      + add_to_userinfo     = false
      + claim_name          = "pho-rsc_role"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + multivalued         = false
      + name                = "PHO-RSC Role"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["administrator"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "administrator"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["publisher"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "publisher"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["viewer"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "viewer"
      + realm_id  = "moh_applications"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*